# GetLoadParent

## Description
Get the count of cells attached to a Lighting Device.

```pascal
FUNCTION GetLoadParent(handle : HANDLE) : HANDLE;
```

```python

def vs.GetLoadParent(handle):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||

## Version
Availability: from Vectorworks 2025
## Category
* Spotlight